; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 835809 2 1 4 5 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph0 - mode
	infrared3 - mode
	image2 - mode
	thermograph1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Planet5 - direction
	Phenomenon6 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 image2)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
)
(:goal (and
	(pointing satellite1 Star1)
	(have_image Planet5 image2)
	(have_image Phenomenon6 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (turn_to satellite1 star1 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star1)
   goals met: 1 of 3
4. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 3
5. (turn_to satellite1 star0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star0)
   goals met: 0 of 3
6. (turn_to satellite0 phenomenon6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 3
7. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 3
8. (take_image satellite0 phenomenon6 instrument0 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 1 of 3
9. (turn_to satellite1 star1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star1)
   goals met: 2 of 3
10. (turn_to satellite1 planet5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet5)
   goals met: 1 of 3
11. (take_image satellite1 planet5 instrument1 image2)
   added: (have_image planet5 image2)
   goals met: 2 of 3
12. (turn_to satellite1 star1 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star1)
   goals met: 3 of 3
